[
  {
    "slug": "la-sra-tomasa",
    "title": "LA SRA.TOMASA LIVE",
    "category": "visuals",
    "year": 2024,
    "description": 
      "Bébeme is the song by the Catalan band, La Sra. Tomasa, for which this visual was customised based on reactive coordinates to the audio input. \n A mix between the fluidity of water and the neural connection of the mind.",
    "media": [
      {}
    ],
    "links": { "site": null, "repo": null },
    "tags": ["#Touchdesigner, #Particle System, #After Effects, #Audioreactive Visuals"]
  },
  {
    "slug": "vj-canibal",
    "title": "VJ CANIBAL",
    "category": "visuals",
    "year": 2024,
    "description": 
      "The adrenaline of live performance is something that, for me, goes hand in hand with being a VJ. \n Enjoying opportunities like this, shooting visuals for what was Canibal in the Sala Apolo. \n Searching in the dark corners of the internet I came up with this visual performance based on a series of drawings from 1997.",
    "media": [
      {}
    ],
    "tags": [""]
  },
  {
    "slug": "visual-razzmatazz",
    "title": "REAL-TIME B2B VISUALS RAZZMATAZZ",
    "category": "visuals",
    "year": 2024,
    "description": "With the aim of creating visuals all night long at Razzmatazz Club Barcelona, I created a set of generative visuals in TouchDesigner with an abstract and geometric aesthetic. \n Together with my colleagues, we set up a half-cube-shaped screen with the intention of giving the visuals a specific perspective. \n Finally, we placed cameras in the booth and in a wide shot, and my colleague, VJ and video technician Ooltraa, and I began our 6-hour B2B on 19 July 2025.",
    "media": [
      { "type": "image", "src": "images/b2b_razzmatazz/b2b_razzmatazz1.png", "alt": "REAL-TIME B2B VISUALS RAZZMATAZZ" },
      { "type": "image", "src": "images/b2b_razzmatazz/b2b_razzmatazz2.png", "alt": "REAL-TIME B2B VISUALS RAZZMATAZZ" },
      { "type": "image", "src": "images/b2b_razzmatazz/b2b_razzmatazz3.png", "alt": "REAL-TIME B2B VISUALS RAZZMATAZZ" },
      { "type": "image", "src": "images/b2b_razzmatazz/b2b_razzmatazz4.png", "alt": "REAL-TIME B2B VISUALS RAZZMATAZZ" },
      { "type": "image", "src": "images/b2b_razzmatazz/b2b_razzmatazz5.png", "alt": "REAL-TIME B2B VISUALS RAZZMATAZZ" }
    ],
    "tags": ["placeholder"]
  },
  {
    "slug": "b613-video-mapping",
    "title": "B-613 VIDEO MAPPING",
    "category": "visuals",
    "year": 2024,
    "description": "Creating a living scenography with the design and implementation of a video mapping set for the premiere of the album B-613 by Eloi Canyelles at the Sala Liverpool in Molins de Rey. Creating a living scenography",
    "media": [
      {}
    ],
    "tags": ["#Resolume Arena, #VJ, #After Effects"]
  },  
  {
    "slug": "shared-frequency",
    "title": "SHARED FREQUENCY",
    "category": "visuals",
    "year": 2024,
    "description": "Shared Frequency is a collaborative sound-work and wearable interface that transforms human gaze into musical form. \n Rooted in a collective workshop and built with open-source tools, the piece explores how perception—especially the act of looking—can become a shared instrument. \n With the brief to create an image for the Naked Spaces project, I created two visual proposals, one following an aesthetic of flashes of light and refraction and the other a 3D element made of audio-reactive particles, presented in their exhibition space at the SEEING, AN EYE AND A BOX fair at Convent Sant Agusti.",
    "media": [
      { }
    ],
    "tags": [""]
  },
  {
    "slug": "live-son-de-rosas",
    "title": "LIVE SON DE ROSAS",
    "category": "visuals",
    "year": 2024,
    "description": "A very fun project in which I worked with video editing and AI to capture the essence of La Oreja de Van Gogh and bring dynamism to Son de Rosas' gigs.",
    "media": [
      { }
    ],
    "tags": [""]
  },
  {
    "slug": "algolab-algorithmic-nature",
    "title": "Alghorithmic Nature",
    "category": "algolab",
    "year": 2025,
    "description": "Algorithmic Nature leads into a journey where technology meets the natural world, pushing the boundaries of how we perceive and interact with our environment. \n This project transforms the internal reactions of plants into a dynamic audiovisual experience, highlighting the creative potential of living systems as they generate infinite combinations of data. \n By reinterpreting these natural processes through sound and visuals, the piece fosters a deeper understanding of plants as active, responsive entities, inviting audiences to appreciate their interconnectedness with all life. \n Algorithmic Nature challenges us to envision a future where technology does not just document nature, but collaborates with it, enabling a richer, more immersive engagement with the ecosystem around us.",
    "media": [
      {}
    ],
    "tags": [""]
  },
  {
    "slug": "ascii-code-sounded",
    "title": "ASCII Code Sounded",
    "category": "algolab",
    "year": 2025,
    "description": "",
    "media": [
      {}
    ],
    "tags": [""]
  },
  {
    "slug": "blobtrack-sounded",
    "title": "blobtrack Sounded",
    "category": "algolab",
    "year": 2025,
    "description": "",
    "media": [
      {}
    ],
    "tags": [""]
  },
  {
    "slug": "lost&found",
    "title": "Lost & Found",
    "category": "algolab",
    "year": 2025,
    "description": "",
    "media": [
      {}
    ],
    "tags": [""]
  },
  {
    "slug": "universal-remedy",
    "title": "Universal Remedy",
    "category": "algolab",
    "year": 2025,
    "description": "",
    "media": [
      {}
    ],
    "tags": [""]
  },
  {
    "slug": "light-hole",
    "title": "Light Hole",
    "category": "installations",
    "year": 2025,
    "description": "This project is defined as a game of illusions between light and sound. \n By combining DMX technology with audio analysis, The Light Hole emerges as an interactive experience where the user can perceive their own voice in a unique way, regardless of the environment where the installation is located.",
    "media": [
      {}
    ],
    "tags": [""]
  },
  {
    "slug": "no-signal",
    "title": "No Signal",
    "category": "installations",
    "year": 2025,
    "description": "This audiovisual project explores electricity as a living, omniscient entity. \n Through a suspenseful visual narrative, the project redefines our relationship with this invisible energy, presenting it as an omnipresent eye that watches over every aspect of human life. \n With a conceptual approach and tense aesthetic, ‘No signal’ challenges us to see beyond the everyday, confronting us with the unsettling possibility that the electric force, as familiar as it is feared, is a contemporary god that never ceases to watch.",
    "media": [
      {}
    ],
    "tags": [""]
  },
  {
    "slug": "societys-sexuality",
    "title": "Society's Sexuality",
    "category": "installations",
    "year": 2025,
    "description": "Society can be tough and damaging to certain people that do not adjust to the standards thatthe culture and society expects from them. \n In this project, a voice wanted to be given to these people that had not fit in due to their sexual orientation and, as a result, had an identity crisis from having been discriminated against. \n The aim was not just to give them a voice, but to also create a manifesto explaining the existence of sexual diversity and creating an interactive implementation.",
    "media": [
      {}
    ],
    "tags": [""]
  },
  {
    "slug": "the-nest",
    "title": "The Nest",
    "category": "installations",
    "year": 2025,
    "description": "The Nest is a new corporate identity party organiser based in Castellbisbal. \n As a customised structure, I made a project proposal that included a detailed proposal, customised plans together with materials of the base structure, technical rider of the LED systems and a preview of how the piece would be finally visualised.",
    "media": [
      {}
    ],
    "tags": [""]
  }
]

